package com.arithmetic.exercise;

public class Arrays {
	/*
	 * 1.给定一个数组，使得非0的数排在前面，0排在后面，且非0的数相对位置不变
	 * 2.给定一个数组和一个数值，将所有与数值相等的数删除，返回剩余个数
	 * 3.给定一个有序数组，对数组中的元素去重，每个元素只有一个。返回去重后的长度
	 * 4.给定一个有序数组，对数组中的元素去重，每个元素只有二个。返回去重后的长度
	 * 
	 * 对撞指针
	 * 5.给定一个有序数组和一个数值，在其中找两个元素使和等于该数值，返回这两个元素的索引
	 * 6.给定一个字符串，只考虑字母与数字，忽略大小写，判断是否是回文数
	 * 7.给定一个整数数组，任意选择两个元素做为墙容纳最多的水
	 */
	
	
	/*
	 *滑动窗口 
	 *1.给定一个数组与一个数值，找出一个最短连续子数组，使得子数组的和大于等于该数值，返回子数组的长度
	 *2.在一个字符串中寻找一个没有重复字符的最长字串
	 *3.给定一个字符串s和一个非空字符串p，找出p中的所有字符都是s的子串，返回这些子串的索引。
	 *如：‘cbaebaback’,返回【0，6】
	 *4.给定字符串s和t,在s中寻找最短的子串 使包含t中所有的字符
	 */
	
	/*
	 * 查找问题
	 * 1.给定两个数组，求公共元素
	 * 2.给定一个数组和一个数值，在其中找两个元素使和等于该数值，返回这两个元素的索引
	 * 3.给定一个数组，寻找不同的三元组，使得三元组之和为0
	 * 4.给定一个数组，寻找不同的三元组，使得三元组之和接近目标值
	 */
}
