package com.arithmetic.exercise;

public class Lists {
	/*
	 * 206.反转链表
	 * 92.反转一个链表从m到n的元素
	 * 83.给定一个有序链表，删除重复元素
	 * 86.给定一个链表和数值x，使得左边的数小于x，右边的数大于x
	 * 328.给定一个链表，索引为奇数的元素排列在索引为偶数的元素前面，奇数与偶数元素要保持相对顺序
	 * 2.给定两个链表逆序存储两个整数，返回两个整数相加后生成的链表
	 * 445.给定两个链表顺序存储两个整数，返回两个整数相加后生成的链表
	 *虚拟头结点
	 * 203. 在链表中删除值为val的元素
	 * 82.给定一个有序链表，删除所有重复元素
	 * 21.归并两个有序链表
	 * 24.给定一个链表，交换每两个相邻元素的位置 
	 * 25.给定一个链表，每k个节点为一组，反转每一组。剩余节点不足k个不需要反转。
	 * 147.对一个链表进行插入排序
	 * 148.对一个链表进行归并排序
	 * 
	 * 双指针
	 * 19.给定一个链表，删除倒数第n个节点
	 * 61.给定一个链表，向右旋转k位
	 * 如何得到一个链表的中间位置
	 * 234.给定一个链表，判断是否是回文链表
	 * 
	 */
}
