package com.arithmetic.exercise;
/*
 * 查找表问题
 */
public class SelectTables {

	/*
	 * 查找问题
	 * 349.给定两个数组，求公共元素
	 * 350.给定两个数组，求两个数组的交集
	 * 2.给定一个数组和一个数值，在其中找两个元素使和等于该数值，返回这两个元素的索引，索引不能重复
	 * 15.给定一个数组，寻找不同的三元组，使得三元组之和为0
	 * 16.给定一个数组，寻找不同的三元组，使得三元组之和接近目标值
	 * 454.给定4个数组a,b,c,d，元素个数相同，寻找h,j,k,l,使得a[h]+b[j]+c[k]+d[l]=0,返回解的个数
	 * 49.给定一个字符串数组，将所有可以通颠倒字符顺序产生相同结果的单词进行分组
	 * 447.一个平面内有n个点，点的坐标[-10000，10000]，寻找a,b,c使得a到b 的距离 等于a到c的距离，返回所有解
	 * 149.一个平面内有n个点，求有最多有多少个点在一条直线上
	 * 219.给定一个整形数组A与数值k，是否存在索引i,j，使得A[i] == A[j],且i,j 的差不超过k
	 * 220.给定一个整形数组A，是否存在索引i,j，使得A[i],A[j]之差不超过t，i,j之差不超过K
	 */
}
