<<<<<<< HEAD
package com.arithmetic.thought;
/*
 * 回溯
 */
public class Backtracking {
	/*
	 * 树形问题
	 * 17.给定一个数字字符串，返回这个数字字符串所能表示的所有字符组合
	 * 
	 * 组合问题
	 * 77.给定整数n,k,求在1-n的n个数中选出k个数的所有组合
	 * 39.给定一个集合，元素各不相同，还有一个数字t，寻找所有该集合中元素的组合，使得组合元素之和为t。元素可以多次使用
	 * 40.给定一个集合，元素可能相同，还有一个数字t，寻找所有该集合中元素的组合，使得组合元素之和为t。元素只能使用一次
	 * 
	 * 79.给定一个二维字符数组与一个单词，判断能否在这个二维平面上找到该单词。规则是从一个字母出现，可以从4个方向连接下一个字母，
	 * ，同一个位置的字母只能使用一次。
	 * 200.给定一个二维数组，只含有0和1字符。0表示水域，1表示陆地。陆地与陆地相连成岛屿，被水域分隔开。问有多少个岛屿。
	 * 417.给定一个二维数组，元素值表示地形高度。左上角为太平洋，右下角为大西洋，水可以往同等高度或者更低高度流，
	 * 求可以同时流向太平洋和大西洋的地形坐标。
	 * 130.给定一个二维数组，含有O和X，找到所有被X包围的O并将其置换为X。
	 * 
	 * 51.n皇后问题。n个皇后摆在n*n的棋盘中，使得横竖斜线均不会出现2个皇后。
	 * 37.数独问题
	 * 
	 */
}
=======
package com.arithmetic.thought;
/*
 * 回溯
 */
public class Backtracking {
	/*
	 * 树形问题
	 * 17.给定一个数字字符串，返回这个数字字符串所能表示的所有字符组合
	 * 
	 * 组合问题
	 * 77.给定整数n,k,求在1-n的n个数中选出k个数的所有组合
	 * 39.给定一个集合，元素各不相同，还有一个数字t，寻找所有该集合中元素的组合，使得组合元素之和为t。元素可以多次使用
	 * 40.给定一个集合，元素可能相同，还有一个数字t，寻找所有该集合中元素的组合，使得组合元素之和为t。元素只能使用一次
	 * 
	 * 79.给定一个二维字符数组与一个单词，判断能否在这个二维平面上找到该单词。规则是从一个字母出现，可以从4个方向连接下一个字母，
	 * ，同一个位置的字母只能使用一次。
	 * 200.给定一个二维数组，只含有0和1字符。0表示水域，1表示陆地。陆地与陆地相连成岛屿，被水域分隔开。问有多少个岛屿。
	 * 417.给定一个二维数组，元素值表示地形高度。左上角为太平洋，右下角为大西洋，水可以往同等高度或者更低高度流，
	 * 求可以同时流向太平洋和大西洋的地形坐标。
	 * 130.给定一个二维数组，含有O和X，找到所有被X包围的O并将其置换为X。
	 * 
	 * 51.n皇后问题。n个皇后摆在n*n的棋盘中，使得横竖斜线均不会出现2个皇后。
	 * 37.数独问题
	 * 
	 */
}
>>>>>>> 02bffa1629e700b327f64c46ccb3692216d2d4bf
