package com.arithmetic.thought;

public class DP3 {
	/*
	 * 70.有n阶楼梯， 一次可以上一个台阶也可以上两个台阶，求有多少种方法。
	 * 64.给出一个m*n的矩阵，每个格子包含一个非负整数，寻找一条从左上角到右下角的路径，使得路径所经过格子的和最小。只能向下或者向右。
	 * 343.给定一个正整数，分割成多个数之和，最少要分割成两个数，若要让这些数之积最大，求分割方法，返回积。
	 * 279.给定一个正整数n，寻找最少的完全平方数，使其和为n。
	 * 91.一个字符串，包含A-Z，对应1-26。给定一个数字串，求有多少种解析方法。
	 * 62.有一个机器人，从m*n的矩阵的左上角移动到右下角，只能向右或者向下移到，求有多少种路径。
	 * 63.有一个机器人，从m*n的矩阵（有障碍物）的左上角移动到右下角，只能向右或者向下移到，求有多少种路径。
	 * 198.有一条街的房子，房子里有不同数量 的宝物，同时偷连着的两个房子会触发报警系统，求能偷到的最大价值。
	 * 213.有一条环形街的房子，房子里有不同数量 的宝物，同时偷连着的两个房子会触发报警系统，求能偷到的最大价值。
	 * 337.有一条二叉树街的房子，房子里有不同数量 的宝物，同时偷连着的两个房子会触发报警系统，求能偷到的最大价值。
	 * 309.给定一个数组，表示股票在每一天的价格，每天只能进行一次操作，买了后必需卖掉才可以再次买 入，卖掉后的
	 * 下一天不可以买 入股票，求如何交易让利润最大。
	 * 
	 * 背包问题变种
	 * 416.给定一个正整数数组，是否可以把数组分成两部分，使得两部分的和相等。
	 * 322.给定不同面值的硬币，最少需要多少枚硬币，可以凑成指定金额。
	 * 377.给定一个整数数组，元素没有重复，问有多少种可能凑出指定金额。
	 * 139.给定一个非空字符串s和一个字符串数组，数组中没有重复元素，能否使用数组中的字符串首尾相连 组成s。
	 * 494.给定一个非0的数字序列，在数字前加上+ - 号，使结果等于目标值。返回有多少种可能
	 * 
	 * 300.给定一个数组，求最长上升子序列。
	 * 376.给定一个数组，求最长的wiggle sequence 子序列。就是一升一降交替的序列。
	 * 
	 * 
	 */
}
